<?php

/*******************************************************************************************
	
	XMLRPC投稿通知メール設定ファイル
	
	@package  mailFormConfig
	@author   oldoffice.com
	@since    PHP 5.3
	@ver      4.1.1
	
	@memo

*******************************************************************************************/

/*--------------------------------------------------------------------
	送信メール設定
--------------------------------------------------------------------*/

/* 送信先 */

	$mail_to = 'user@client.com';
//	$mail_to = 'nishikawa@oldoffice.com';

/* 送信メール タイトル */

$title = 'WEBサイト掲示板の投稿認証';

/* 送信メール 本文 */
// *チェックボックス変数[CB]をつける（ex $CBproperty）

$text .= "\n";
$text .= 'WEBサイトの掲示板に投稿がありましたので、ご確認の上、認証してください。'."\n";
$text .= "\n";
$text .= 'http://domain.com/bbs/wp-admin/post.php?post=' . $post_id . '&action=edit' . "\n";
$text .= "\n";
$text .= '------------------------------------------------' . "\n";
$text .= "\n";
$text .= '掲示板投稿内容'."\n";
$text .= "\n";
$text .= 'ハンドルネーム：'.$form_name."\n";
$text .= '質問内容：'.$form_message."\n";
$text .= "\n";
$text .= '------------------------------------------------' . "\n";

$contents = $text;


/*--------------------------------------------------------------------
	自動返信メール設定
--------------------------------------------------------------------*/

/*　「on」「off」の設定　*/

$auto_return = "on";

/*　送信元、タイトルの設定　*/

$return_title = "";

$text = "";


$return_contents = $text;


/*--------------------------------------------------------------------
	完了画面メッセージ
--------------------------------------------------------------------*/

$ok_message = '投稿いただきありがとうございました。<br>しょういたしますのでしばらくお待ちください。';
$error_message = 'メールが送信されませんでした。';
$no_open_message = 'このファイルは不正に開かれました。送信を実行できません。';


/*--------------------------------------------------------------------
	複数送信先設定
--------------------------------------------------------------------*/

$CC = "off";

$CC_mail_to = array(
	"info@crient-url.com",
	"info@crient-url.com"
	);

$BCC = "off";

$BCC_mail_to = array(
	"info@crient-url.com",
	"info@crient-url.com"
	);

/*--------------------------------------------------------------------
	メール送信元のアドレス設定　*変数に直接アドレス記入可
--------------------------------------------------------------------*/

$return_mail_from = $mail_to;
$mail_from = $form_email;

?>
