<?php
/*
--------------------------------
タグのPHP戻し
--------------------------------

■ 1 準備

タブつめ

■ 2 置換

2-1
' \. 
<?= 

 . '
 ?>

2-2
\\t
\t

2-3
\$tag \.= \$tb \. "((\t)*)" \. '(.+)' \. "\\n";
$1$3

■ 3 必要事項記入

■ 5 条件分岐の記述

// 注釈 名前
if( true ) {
} else {
}

■ 6 heading の変換

<h4 class="heading04">(.*)</h4>
<h5 class="heading05">$1</h5>

<h3 class="heading03">(.*)</h3>
<h4 class="heading04">$1</h4>

<h2 class="heading02">(.*)</h2>
<h3 class="heading03">$1</h3>

--------------------------------
タグのPHP化
--------------------------------

■ 1 準備

対象コードをこのページの下部にぺーすと ※最終行に改行を入れる
最小タブを0につめる

■ 2 置換

2-1 正規表現置換：前
(\t*)<(.+)>
2-1 正規表現置換：後
$tag .= $tb . "$1" . '<$2>' . "\\n";

2-2 正規表現置換：前
\t
2-2 正規表現置換：後
\\t

2-3 正規表現置換：前
<\?php echo ([^;?>]*);\?>
2-3 正規表現置換：後
' . $1 . '

■ 3 必要事項記入

下記に貼り付けエリア名、タブを合わせる
	$tag = '';
	$tb  = "\t\t\t\t\t";

	//$arr = $wp_posts_array;

	echo $tag;
/*
--------------------------------
wp php準拠
--------------------------------

\(([^ )])
( $1

\[([^ \]])
[ $1

([^ 	(])\)
$1 )

([^ 	[])\]
$1 ]
--------------------------------
php準拠
--------------------------------

■ 1 準備

include_once\( (.+) \);
include_once $1;

--------------------------------
配列
--------------------------------

([^_])array\( ([^)]*) \)
$1[ $2 ]

array\(\n(([^()]*\n)+)(\t+)\)
[\n$1$3]

--------------------------------
heading の変換
--------------------------------

<h4 class="heading04">(.*)</h4>
<h5 class="heading05">$1</h5>

<h3 class="heading03">(.*)</h3>
<h4 class="heading04">$1</h4>

<h2 class="heading02">(.*)</h2>
<h3 class="heading03">$1</h3>



--------------------------------
除外
--------------------------------

Search-Replace-DB-master
__cf
eccube

*/